Repository: vivisystems/roundrock
Catalog: intl/pofile/*/messages.properties.po
Languages: ja_jp, pt_br

source: Condiments
ja_jp: 調味
pt_br: Condimentos

source: Departments
ja_jp: 部門設定
pt_br: Departamentos

source: Promotions (inactive)
ja_jp: プロモーション（停止中）
pt_br: Promoções (inactivo)

source: Employees
ja_jp: 従業員
pt_br: Empregados

source: Jobs
ja_jp: 仕事内容
pt_br: Tarefas

source: Products
ja_jp: 商品
pt_br: Produtos

source: Roles
ja_jp: 役割
pt_br: Regras

source: Taxes
ja_jp: Taxes Report
pt_br: Taxes Report

# pricelevelshift.label
source: Price Level Shift
ja_jp: 価格設定切換
pt_br: Mudança de Nível de Preço

# pricelevelshift.name
source: Price Level Shift
ja_jp: 価格設定切換
pt_br: Mudança de Nível de Preço

# pricelevel1.label
source: Price Level 1
ja_jp: 価格設定１
pt_br: Nível de Preço 1

# pricelevel1.name
source: Price Level 1
ja_jp: 価格設定１
pt_br: Nível de Preço 1

# pricelevel2.label
source: Price Level 2
ja_jp: 価格設定２
pt_br: Nível de Preço 2

# pricelevel2.name
source: Price Level 2
ja_jp: 価格設定２
pt_br: Nível de Preço 2

# pricelevel3.label
source: Price Level 3
ja_jp: 価格設定３
pt_br: Nível de Preço 3

# pricelevel3.name
source: Price Level 3
ja_jp: 価格設定３
pt_br: Nível de Preço 3

# pricelevel4.label
source: Price Level 4
ja_jp: 価格設定４
pt_br: Nível de Preço 4

# pricelevel4.name
source: Price Level 4
ja_jp: 価格設定４
pt_br: Nível de Preço 4

# pricelevel5.label
source: Price Level 5
ja_jp: 価格設定５
pt_br: Nível de Preço 5

# pricelevel5.name
source: Price Level 5
ja_jp: 価格設定５
pt_br: Nível de Preço 5

# pricelevel6.label
source: Price Level 6
ja_jp: 価格設定６
pt_br: Nível de Preço 6

# pricelevel6.name
source: Price Level 6
ja_jp: 価格設定６
pt_br: Nível de Preço 6

# pricelevel7.label
source: Price Level 7
ja_jp: 価格設定７
pt_br: Nível de Preço 7

# pricelevel7.name
source: Price Level 7
ja_jp: 価格設定７
pt_br: Nível de Preço 7

# pricelevel8.label
source: Price Level 8
ja_jp: 価格設定８
pt_br: Nível de Preço 8

# pricelevel8.name
source: Price Level 8
ja_jp: 価格設定８
pt_br: Nível de Preço 8

# pricelevel9.label
source: Price Level 9
ja_jp: 価格設定９
pt_br: Nível de Preço 9

# pricelevel9.name
source: Price Level 9
ja_jp: 価格設定９
pt_br: Nível de Preço 9

# shifttax.label
source: Shift Tax
ja_jp: 税金切換
pt_br: Mudança de Taxa

# shifttax.name
source: Shift Tax
ja_jp: 税金切換
pt_br: Mudança de Taxa

source: Percentage Discount
ja_jp: 割引の割合
pt_br: Percentagem de Desconto

source: Reduction
ja_jp: 割引
pt_br: Redução

source: Surcharge
ja_jp: 割増
pt_br: Acréscimo

source: PLUS
ja_jp: 追加金額
pt_br: MAIS

# cash.label
source: Cash
ja_jp: 現金
pt_br: Caixa

# cash.name
source: Cash
ja_jp: 現金
pt_br: Caixa

source: Key
ja_jp: キー
pt_br: Tecla

source: Keypress
ja_jp: キー
pt_br: Tecla Pressionada

# clear.label
source: Clear
ja_jp: クリアー
pt_br: Limpar

# clear.name
source: Clear
ja_jp: クリアー
pt_br: Limpar

# enter.label
source: Enter
ja_jp: 入力

# enter.name
source: Enter
ja_jp: 入力

source: Quantity
ja_jp: 数量
pt_br: Quantidade

source: SUB TOTAL
ja_jp: 小計

# traymarker.label
source: Tray Marker
ja_jp: 標記
pt_br: Marcador da Bandeja

# traymarker.name
source: Tray Marker
ja_jp: 標記
pt_br: Marcador da Bandeja

source: This function cancels the current order. No parameter is needed.
ja_jp: この機能は今の注文をキャンセルします。パラメーターは必要ありません。
pt_br: Esta função cancela o pedido actual. Não necessita de parâmetros.

# cancel.label
source: Cancel
ja_jp: キャンセル
pt_br: Cancelar

# cancel.name
source: Cancel
ja_jp: キャンセル
pt_br: Cancelar

# plusearch.label
source: Product Search
ja_jp: 商品検索
pt_br: Pesquisa de produto

# plusearch.name
source: Product Search
ja_jp: 商品検索
pt_br: Pesquisa de produto

# pushqueue.label
source: Queue Order
ja_jp: 待ちオーダー
pt_br: Pedidos Pendentes

# pushqueue.name
source: Queue Order
ja_jp: 待ちオーダー
pt_br: Pedidos Pendentes

# pullqueue.label
source: View Queue
ja_jp: 待ちオーダーを見る
pt_br: Visualizar Pendentes

# pullqueue.name
source: View Queue
ja_jp: 待ちオーダーを見る
pt_br: Visualizar Pendentes

source: Modify
ja_jp: 修正
pt_br: Modificar

source: Modify Item
ja_jp: 修正
pt_br: Modificar Artigo

source: This function voids the last transaction. No parameter is needed.
ja_jp: この機能は最後の処理を取り消します。パラメーターは必要ありません。
pt_br: Esta função permite anular a última transacção. Não necessita de parâmetros.

# voidItem.label
source: VOID
ja_jp: 取消
pt_br: ANULAR

# voidItem.name
source: VOID
ja_jp: 取消
pt_br: ANULAR

# houseBon.label
source: House BON
ja_jp: ギフト
pt_br: BON. CASA

# houseBon.name
source: House BON
ja_jp: ギフト
pt_br: BON. CASA

source: This function signs off the current operator. No parameter is needed.
ja_jp: この機能は現在のオペレーターをログアウトさせます。パラメーターは必要ありません。
pt_br: Esta função faz sair do sistema o operador corrente. Não necessita de parâmetros.

# signOff.label
source: Sign Off
ja_jp: ログアウト
pt_br: Sair do Sistema

# signOff.name
source: Sign Off
ja_jp: ログアウト
pt_br: Sair do Sistema

# currencyConvert.label
source: Currency Exchange
ja_jp: 両替
pt_br: Câmbio

# currencyConvert.name
source: Currency Exchange
ja_jp: 両替
pt_br: Câmbio

# changeToCurrentLevel.label
source: Reset Price Level
ja_jp: 価格設定を再設定
pt_br: Restaurar Nível de Preço

# changeToCurrentLevel.name
source: Reset Price Level
ja_jp: 価格設定を再設定
pt_br: Restaurar Nível de Preço

# silentsignoff.label
source: Silent User Switch
ja_jp: サイレントユーザースイッチ
pt_br: Mudança Silenciosa de Utilizador

# silentsignoff.name
source: Silent User Switch
ja_jp: サイレントユーザースイッチ
pt_br: Mudança Silenciosa de Utilizador

source: Change Clerk
ja_jp: 従業員を交換
pt_br: Mudar de Empregado

source: Quick User Switch
ja_jp: 従業員を即交換
pt_br: Mudança Rápida de Empregado

# dispatch.label
source: Dispatch
ja_jp: 派遣
pt_br: Expedição

# dispatch.name
source: Dispatch
ja_jp: 派遣
pt_br: Expedição

# return.label
source: Refund
ja_jp: 返品
pt_br: Devolução

# return.name
source: Refund
ja_jp: 返品
pt_br: Devolução

# creditcard.label
source: Credit Card
ja_jp: クレジットカード
pt_br: Cartão de Crédito

# creditcard.name
source: Credit Card
ja_jp: クレジットカード
pt_br: Cartão de Crédito

# giftcard.label
source: Gift Card
ja_jp: ギフトカード
pt_br: Cartão Oferta

# giftcard.name
source: Gift Card
ja_jp: ギフトカード
pt_br: Cartão Oferta

# addmemo.label
source: Add Memo
ja_jp: メモを追加
pt_br: Adicionar Comentários

# addmemo.name
source: Add Memo
ja_jp: メモを追加
pt_br: Adicionar Comentários

# addcondiment.label
source: Add Condiment
ja_jp: 調味を追加
pt_br: Adicionar Condimento

# addcondiment.name
source: Add Condiment
ja_jp: 調味を追加
pt_br: Adicionar Condimento

# surchargePretaxByPercentage.label
source: Pretax Order Surcharge
ja_jp: 税込み割増オーダー
pt_br: Acréscimo de Pré-Taxa à Encomenda

# surchargePretaxByPercentage.name
source: Pretax Order Surcharge
ja_jp: 税込み割増オーダー
pt_br: Acréscimo de Pré-Taxa à Encomenda

# discountPretaxByPercentage.label
source: Pretax Order Discount
ja_jp: 税込み割引オーダー
pt_br: Desconto Pré-Taxa à Encomenda

# discountPretaxByPercentage.name
source: Pretax Order Discount
ja_jp: 税込み割引オーダー
pt_br: Desconto Pré-Taxa à Encomenda

source: dummy
ja_jp: ダミー
pt_br: sem efeito

source: Override Default Price Level
ja_jp: 初期価格の手数料
pt_br: Sobrepor o Nível de Preço por Defeito

source: Change Price Level
ja_jp: 価格変更
pt_br: Mudar o Nível de Preço

source: Set Price Level 1
ja_jp: セット価格１
pt_br: Colocar Preço Nível 1

source: Set Price Level 2
ja_jp: セット価格２
pt_br: Colocar Preço Nível 2

source: Set Price Level 3
ja_jp: セット価格３
pt_br: Colocar Preço Nível 3

source: Set Price Level 4
ja_jp: セット価格４
pt_br: Colocar Preço Nível 4

source: Set Price Level 5
ja_jp: セット価格５
pt_br: Colocar Preço Nível 5

source: Set Price Level 6
ja_jp: セット価格６
pt_br: Colocar Preço Nível 6

source: Set Price Level 7
ja_jp: セット価格７
pt_br: Colocar Preço Nível 7

source: Set Price Level 8
ja_jp: セット価格８
pt_br: Colocar Preço Nível 8

source: Set Price Level 9
ja_jp: セット価格９
pt_br: Colocar Preço Nível 9

source: Revert Price Level
ja_jp: 復帰価格
pt_br: Reverter Nível de Preço

source: Override HALO
ja_jp: 最高価格の手数料
pt_br: Ultrapassar HALO

source: Override LALO
ja_jp: 最低価格の手数料
pt_br: Ultrapassar LALO

# acl_queue_order
source: Queue Order
ja_jp: 待ちオーダー
pt_br: Pedidos Pendentes

source: Pull Order from Queue
ja_jp: 待ちから注文を出す
pt_br: Retirar Encomenda de Pendentes

source: Access Control Panel
ja_jp: コントロールパネル
pt_br: Aceder ao Painel de Controlo

source: Modify Cart Items
ja_jp: カートの品目を変更する
pt_br: Modificar Artigos da Cesta

source: VOID Cart Items
ja_jp: カートの品目を削除する
pt_br: LIMPAR Artigos da Cesta

source: Cancel Order
ja_jp: 注文をキャンセル
pt_br: Cancelar Encomenda

# acl_plu_search
source: Product Search
ja_jp: 商品検索
pt_br: Pesquisa de produto

source: Register Cash Payment
ja_jp: 現金払い
pt_br: Registar Pagamento Caixa

source: Toggle Number Pad
ja_jp: トグルナンバーパット
pt_br: Alternar Teclado Numérico

source: Public Access
ja_jp: 公開アクセス
pt_br: Acesso Público

source: Manage Condiments
ja_jp: 調味管理
pt_br: Gerir Condimentos

source: Manage Currency Exchange
ja_jp: 両替管理
pt_br: Gerir Câmbios de Moeda

source: Manage Departments
ja_jp: 部門管理
pt_br: Gerir Departamentos

source: Manage Employees
ja_jp: 従業員管理
pt_br: Gerir Empregados

source: Manage Function Panel
ja_jp: 機能パネル管理
pt_br: Gerir Painel de Funções

source: Shift Item Tax
ja_jp: 税込みに切り替え
pt_br: Mudar Taxa do Artigo

source: Register Discounts
ja_jp: 割引登録
pt_br: Registar Descontos

source: Register Reductions
ja_jp: 割引登録
pt_br: Registar Reduções

source: Register Surcharges
ja_jp: 割増登録
pt_br: Registar Aumentos

source: Register Additions
ja_jp: 追加料金登録
pt_br: Registar Adições

source: Send Keypresses
ja_jp: Keypressを送信
pt_br: Enviar Conjunto Teclas

source: Register Products
ja_jp: 商品登録
pt_br: Registar Artigos

source: Register ENTER
ja_jp: Enter登録
pt_br: Registar ENTER

source: Register Quantity
ja_jp: 数量登録
pt_br: Registar Quantidade

source: Register Subtotal
ja_jp: 小計登録
pt_br: Registar Sub-total

source: Register Tray Marker
ja_jp: 標記登録
pt_br: Registar Marcado Bandeja

source: Register House BON
ja_jp: ギフト登録
pt_br: Registar BON. Casa

source: Register Currency Exchange
ja_jp: 両替登録
pt_br: Registar Câmbio Moeda

source: Manage Jobs
ja_jp: 仕事登録
pt_br: Gerir Tarefas

source: Manage Product Groups
ja_jp: 商品グループ登録
pt_br: Registar Grupo de Produtos

source: Manage Price Level Schedule
ja_jp: 価格表登録
pt_br: Gerir Programação de Nível de Preços

source: Manage Access Groups
ja_jp: アクセルグループ管理
pt_br: Gerir Grupos de Acesso

source: Manage Stock
ja_jp: 在庫管理
pt_br: Gerir Stocks

source: Manage System Options
ja_jp: システム選択管理
pt_br: Gerir Opções de Sistema

source: Manage Taxes
ja_jp: 税金管理
pt_br: Gerir Taxas

source: Manage Products
ja_jp: 商品管理
pt_br: Gerir Produtos

source: Register Item Return
ja_jp: 返品管理
pt_br: Registar Artigos Devolvidos

source: Register Credit Card Payment
ja_jp: クレジットカード払い
pt_br: Registar Pagamento por Cartão de Crédito

source: Register Gift Card Payment
ja_jp: ギフトカード払い
pt_br: Registar Pagamento por Cartão Oferta

source: Manage Images
ja_jp: イメージ管理
pt_br: Gerir Imagens

source: Modify Keymap Parameter
ja_jp: Keymapパラメーターの変更
pt_br: Modificar Parâmentros do Mapa de Teclado

source: Modify Condiment Price
ja_jp: 調味価格の変更
pt_br: Modificar Preço de Condimento

source: Register Order Discounts Pretax
ja_jp: 税込み注文の割引登録
pt_br: Registar Pré-taxa de Descontos de Encomendas

source: Register Order Surcharges Pretax
ja_jp: 税込み注文の割増登録
pt_br: Registar Pré-taxa de Acréscimos de Encomendas
