Repository: vivisystems/roundrock
Catalog: intl/pofile/*/plus.dtd.po
Languages: sv_se

source: Product Properties
sv_se: Produkt Egenskaper

# plus.tab.appearance
source: Appearance
sv_se: Utseende

# plus.tab.pricelevels
source: Price Levels
sv_se: Pris Nivåer

# plus.tab.linkgroups
source: Link Groups
sv_se: Koppla Grupper

source: Product Details
sv_se: Produkt Detaljer

source: Basic Data (Page 1)
sv_se: Basic Data (Sida 1)

source: Basic Data (Page 2)
sv_se: Basic Data (Sida 2)

# plus.appearance
source: Appearance
sv_se: Utseende

# plus.pricelevels
source: Price Levels
sv_se: Pris Nivåer

# plus.linkgroups
source: Link Groups
sv_se: Koppla Grupper

source: Department
sv_se: Avdelningar

source: Product No.
sv_se: Produkt Nr

source: Product Name
sv_se: Produkt Namn

source: Barcode
sv_se: Streckkod

source: Tax Rate
sv_se: Moms Sats

source: Condiments
sv_se: Kondiment

source: Auto-stock
sv_se: Auto-Lager

source: Returns can be restocked
sv_se: Returer kan återföras till lager

source: Condiments required
sv_se: Kondiment Krävs

source: Memo required
sv_se: Memo Krävs

source: Single Item Sale
sv_se: Enkel Artikel Försäljning

source: Show on menu
sv_se: Visa i Meny

source: Require age verification
sv_se: Krävs Ålders Verifiering

source: Display icon only
sv_se: Visa Iconer Endast

source: Purchase Price
sv_se: Öppet Pris

source: Current Stock Level
sv_se: Nuvarande Lager Nivå

source: Minimum Threshold
sv_se: Minimi Nivå

source: Memo
sv_se: Meddelande

source: Minimum Sale Qty
sv_se: Minimum Försäljningsantal

source: Unit of Sale
sv_se: Försäljningsenhet

source: Individually
sv_se: Individuellt

source: Gram
sv_se: Gr

source: Kilogram
sv_se: KG

source: Stock Location
sv_se: Lagerplats

source: No.
sv_se: Nr

source: Name
sv_se: Namn

source: Qty
sv_se: Antal

source: Product Icon
sv_se: Produkt Icon

source: Button Color
sv_se: Knapp Färg

source: Font Size
sv_se: Font Storlek

source: Level
sv_se: Nivå

source: Price
sv_se: Pris

source: Add
sv_se: Lägg till

source: Modify
sv_se: Modifiera

source: Delete
sv_se: Tabort

# plus.button.numpad.clear
source: CLEAR
sv_se: RENSA

# plus.button.numpad.advclear
source: CLEAR
sv_se: RENSA
