Repository: vivisystems/roundrock
Catalog: intl/pofile/*/sysprefs.dtd.po
Languages: ja_jp, pt_br

# preferences.title
source: General Options
ja_jp: 基本機能
pt_br: Opções Gerais

source: Layout
ja_jp: レイアウト
pt_br: Configuração

# category.general
source: General Options
ja_jp: 基本機能
pt_br: Opções Gerais

source: Sign In/Out
ja_jp: ログイン／ログアウト
pt_br: Entrar/Sair

source: Taxes
ja_jp: 税金
pt_br: Taxas

source: Terminal ID
ja_jp: 末端ID
pt_br: ID Terminal

source: Individual Time-and-Attendance visible to all
ja_jp: 全ての従業員の出勤記録を表示
pt_br: Hora de Atendimento Individual visivel para todos

source: Automatically log in default user:
ja_jp: 欠勤従業員に自動的にログイン
pt_br: Entrar automáticamente utilizador por defeito:

source: Private order queue
ja_jp: プライベート待ちオーダー
pt_br: Pedido pendente privado

source: System default price level
ja_jp: システムデフォルト価格設定
pt_br: Nível de preços por defeito no sistema

source: System default tax status
ja_jp: システムデフォルト税
pt_br: Estado da taxa por defeito no sistema

source: Number of decimal places for Prices
ja_jp: 価格の小数点
pt_br: Número de casas decimais para Preços

source: Number of decimal places for Taxes
ja_jp: 税金の小数点
pt_br: Número de casas decimais para Taxas

source: Rounding policy to use for Prices
ja_jp: 価格計算の規則
pt_br: Política de arredondamentos usado nos Preços

source: Rounding policy to use for Taxes
ja_jp: 税金計算の規則
pt_br: Política de arredondamentos usado nas Taxas

source: to nearest precision
pt_br: à precisão mais próxima

source: to nearest half
ja_jp: 0.5まで繰り上げる
pt_br: à metade mais próxima

source: to nearest quarter
ja_jp: 0.25まで繰り上げる
pt_br: ao quarto mais próximo

source: to nearest nickel
ja_jp: 0.05まで繰り上げる
pt_br: ao níquel mais próximo

source: to nearest dime
ja_jp: 0.1まで繰り上げる
pt_br: ao cêntimo mais próximo

source: always round up
ja_jp: 常に切り上げる
pt_br: arrendondar sempre para cima

source: always round down
ja_jp: 常に切り下げる
pt_br: arrendondar sempre para baixo

source: Activate price level schedule
ja_jp: 価格表を起動する
pt_br: Activar programação de nível de preços

source: Price level reverts to schedule after each order
pt_br: Nível de preços reverte ao programado após cada encomenda

source: Clear input buffer when switching departments
ja_jp: 部門を切り替える時にインプットバッファをクリアーする
pt_br: Limpar o buffer de entrada quando mudar entre departamentos

source: Allow negative stock
ja_jp: マイナス在庫を許可する
pt_br: Permitir stocks negativos

source: Require clerk acknowledgement for age verification
ja_jp: 年齢証明のため店員の承認が必要
pt_br: Pedir aceitação de empregado na verificação de idade

source: Automatically discard cart content when signing off
ja_jp: サインアウトした際、自動的にカートの内容が放棄される
pt_br: Perder contéudo da cesta de pedidos quando empregado sai do sistema

source: Automatically discard queued orders when signing off
ja_jp: サインアウトした際、自動的に待ちオーダーが放棄される
pt_br: Perder pedidos pendentes quando o empregado sai do sistema

source: Order queue must be emptied when signing off
ja_jp: サインアウトの時、待ちオーダーはなしの必要がある
pt_br: Pedidos pendentes devem ser esvaziados quando o empregado sai

source: Print shift report when users sign off
ja_jp: 使用者がサインアウトする際、シフト表をプリントアウトする
pt_br: Imprimir relatório de mudança quando o empregado sai

source: Print shift report when quick-switching users
ja_jp: 使用者を交代する際、シフト表はプリントアウトする
pt_br: Imprimir relatório de mudança quando se muda de empregado

source: Allow quick login by automatically matching user by password
ja_jp: 使用者のパスワードが合っていれば自動的にクイックログインする
pt_br: Permitir entrada rápida através da identificação da chave

source: Place register screen on the left side of screen
ja_jp: 登録画面は画面の左側に配置する
pt_br: Colocar o écran de registo no lado esquerdo do écran

source: Hide numeric keypad
ja_jp: 数字のキーパッドは隠す
pt_br: Esconder o teclado numérico

source: Place function key panel at the top of the screen
ja_jp: 機能キーパネルは画面の上に配置する
pt_br: Colocar o painel de funcções no topo do écran

source: Place product panel before department panel
ja_jp: 商品パネルは部門パネルの前に配置する
pt_br: Colocar o painel de produtos antes do painel de departamentos

source: Hide scrollbars for department panel
ja_jp: 部門パネルのスクロールバーは隠す
pt_br: Esconder as barras de deslocação para o painel de departamentos

source: Hide scrollbars for product panel
ja_jp: 商品パネルのスクロールバーは隠す
pt_br: Esconder as barras de deslocação para o painel de produtos

source: Hide scrollbars for function panel
ja_jp: 機能パネルのスクロールバーは隠す
pt_br: Esconder as barras de deslocação para o painel de funções

source: Crop department label
ja_jp: 部門ラベルを切り取る
pt_br: Cortar nome dos departamentos

source: Crop product label
ja_jp: 商品ラベルを切り取る
pt_br: Cortar nome dos produtos

source: Department panel dimensions
ja_jp: 部門パネルサイズ
pt_br: Dimensões do painel de departamentos

# layout.department.rows
source: rows
ja_jp: 横の列
pt_br: linhas

# layout.department.cols
source: columns
ja_jp: 縦の列
pt_br: colunas

source: Product panel dimensions
ja_jp: 商品パネルサイズ
pt_br: Dimensões do painel de produtos

# layout.plu.rows
source: rows
ja_jp: 横の列
pt_br: linhas

# layout.plu.cols
source: columns
ja_jp: 縦の列
pt_br: colunas

source: Function panel dimensions
ja_jp: 機能パネルサイズ
pt_br: Dimensões do painel de funções

# layout.functionpanel.rows
source: rows
ja_jp: 横の列
pt_br: linhas

# layout.functionpanel.cols
source: columns
ja_jp: 縦の列
pt_br: colunas
