Repository: vivisystems/roundrock
Catalog: intl/pofile/*/systembackup.dtd.po
Languages: pt_br, sv_se, zh_cn

source: System Backup
pt_br: Cópia de Segurança do Sistema
zh_cn: 系统备份

source: System Resotre
pt_br: Restauro do Sistema
sv_se: System Återställning
zh_cn: 系统回复

source: Local Backup:
pt_br: Cópia Local:
sv_se: Lokal Backup:
zh_cn: 本机备份:

source: Stick:
pt_br: Pen:
sv_se: USB:
zh_cn: 外接式大姆碟:

source: Copy Local to Stick >>>
pt_br: Copiar Pen para Local >>>
sv_se: Kopiera Lokalt till USB >>>
zh_cn: 复制本机至外接式大姆碟 >>>

source: Backup to Local
pt_br: Cópia de Segurança para Local
sv_se: Backup till Lokalt
zh_cn: 备份至本机

source: Restore from Stick
pt_br: Restaurar de Pen
sv_se: Återställ från USB
zh_cn: 从外接式大姆碟回复系统

source: Resotre from Local
pt_br: Restaurar de Local
sv_se: Återställ från Lokalt
zh_cn: 从本机备份回复系统

source: Ok
zh_cn: 完成

source: Cancel
pt_br: Cancelar
sv_se: Avbryt
zh_cn: 取消

source: Add
pt_br: Adicionar
sv_se: Lägg till
zh_cn: 新增

source: Modify
pt_br: Modificar
sv_se: Modifiera
zh_cn: 修改

source: Delete
pt_br: Apagar
sv_se: Tabort
zh_cn: 删除
