Repository: vivisystems/roundrock
Catalog: intl/pofile/*/users.dtd.po
Languages: ja_jp, pt_pt, sv_se

source: Employees
ja_jp: 従業員
pt_pt: Empregados
sv_se: Anställda

source: User Profile
ja_jp: ユーザープロフィール
pt_pt: Perfil do Utilizador
sv_se: Användar Profil

source: User Limits
ja_jp: ユーザーリミット
pt_pt: Limites do Utilizador
sv_se: Användar Begränsning

source: Check Tracking
ja_jp: チェックトラック
pt_pt: Verificar Seguimento

source: User Name (a..z,0..9)
ja_jp: ユーザー名(a..z,0..9)
pt_pt: Nome de Utilizador (a..z,0..9)
sv_se: Användar Namn

source: Password
ja_jp: パスワード
pt_pt: Chave
sv_se: Lösenord

source: Display Name
ja_jp: 画面名
pt_pt: Nome a Mostrar
sv_se: Display Namn

source: Access Level
ja_jp: アクセルレベル
pt_pt: Nível de Acesso
sv_se: Åtkomst Nivå

source: Default Price Level
ja_jp: デフォルト価格
pt_pt: Nível de Preço por Defeito
sv_se: Std Pris Nivå

source: Default Job
ja_jp: デフォルト仕事
pt_pt: Tarefa por Defeito
sv_se: Std

source: Item Discount Limit
ja_jp: 品目割引限度
pt_pt: Limite de Desconto de Artigo
sv_se: Artikel Rabatt Begränsning

source: Order Discount Limit
ja_jp: 注文割引限度
pt_pt: Limite de Desconto de Pedido
sv_se: Order Rabatt Begränsning

source: Check Cashing Limit
ja_jp: 小切手払い限度
pt_pt: Verificação de Limite de Desconto

source: Item Surcharge Limit
ja_jp: 品目追加料金限度
pt_pt: Limite Acréscimo de Artigo

source: Order Surcharge Limit
ja_jp: オーダー追加料金限度
pt_pt: Limite Acréscimo de Pedido

source: Product Quantity Limit
ja_jp: 商品数量限度
pt_pt: Limite Quantidade de Produto
sv_se: Produkt Antal Begränsning

source: Product Price Limit
ja_jp: 商品価格限度
pt_pt: Limite Preço de Produto
sv_se: Produkt Pris Begränsning

source: Item Coupon Limit
ja_jp: 品目クーポン限度
pt_pt: Limite Artigo Cupão

source: Order Coupon Limit
ja_jp: オーダークーポン限度
pt_pt: Limite Pedido Cupão

source: Minimum Check Number
ja_jp: 最小小計ナンバー
pt_pt: Número Mínimo Verificação

source: Maximum Check Number
ja_jp: 最大小計ナンバー
pt_pt: Número Máximo Verificação

source: Maximum Number of Open Checks
ja_jp: 普通小切手の最大数
pt_pt: Número Máximo de Verificações Abertas

source: Add
ja_jp: 新規・追加
pt_pt: Adicionar
sv_se: Lägg till

source: Modify
ja_jp: 修正
pt_pt: Modificar
sv_se: Modifiera

source: Delete
ja_jp: 削除
pt_pt: Apagar
sv_se: Tabort
