(function($){
const XUL_NS = "http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul";
var zipcode =[
{t:'基隆市',v:'0',c:'C',zip:[{t:'仁愛區',v:'200'},{t:'信義區',v:'201'},{t:'中正區',v:'202'},{t:'中山區',v:'203'},{t:'安樂區',v:'204'},{t:'暖暖區',v:'205'},{t:'七堵區',v:'206'}]},
{t:'臺北市',v:'1',c:'A',zip:[{t:'中正區',v:'100'},{t:'大同區',v:'103'},{t:'中山區',v:'104'},{t:'松山區',v:'105'},{t:'大安區',v:'106'},{t:'萬華區',v:'108'},{t:'信義區',v:'110'},{t:'士林區',v:'111'},{t:'北投區',v:'112'},{t:'內湖區',v:'114'},{t:'南港區',v:'115'},{t:'文山區',v:'116'}]},
{t:'臺北縣',v:'2',c:'F',zip:[{t:'萬里鄉',v:'207'},{t:'金山鄉',v:'208'},{t:'板橋市',v:'220'},{t:'汐止市',v:'221'},{t:'深坑鄉',v:'222'},{t:'石碇鄉',v:'223'},{t:'瑞芳鎮',v:'224'},{t:'平溪鄉',v:'226'},{t:'雙溪鄉',v:'227'},{t:'貢寮鄉',v:'228'},{t:'新店市',v:'231'},{t:'坪林鄉',v:'232'},{t:'烏來鄉',v:'233'},{t:'永和市',v:'234'},{t:'中和市',v:'235'},{t:'土城市',v:'236'},{t:'三峽鎮',v:'237'},{t:'樹林市',v:'238'},{t:'鶯歌鎮',v:'239'},{t:'三重市',v:'241'},{t:'新莊市',v:'242'},{t:'泰山鄉',v:'243'},{t:'林口鄉',v:'244'},{t:'蘆洲市',v:'247'},{t:'五股鄉',v:'248'},{t:'八里鄉',v:'249'},{t:'淡水鎮',v:'251'},{t:'三芝鄉',v:'252'},{t:'石門鄉',v:'253'}]},
{t:'宜蘭縣',v:'3',c:'G',zip:[{t:'宜蘭市',v:'260'},{t:'頭城鎮',v:'261'},{t:'礁溪鄉',v:'262'},{t:'壯圍鄉',v:'263'},{t:'員山鄉',v:'264'},{t:'羅東鎮',v:'265'},{t:'三星鄉',v:'266'},{t:'大同鄉',v:'267'},{t:'五結鄉',v:'268'},{t:'冬山鄉',v:'269'},{t:'蘇澳鎮',v:'270'},{t:'南澳鄉',v:'272'}]},
{t:'桃園縣',v:'4',c:'H',zip:[{t:'中壢市',v:'320'},{t:'平鎮市',v:'324'},{t:'龍潭鄉',v:'325'},{t:'楊梅鎮',v:'326'},{t:'新屋鄉',v:'327'},{t:'觀音鄉',v:'328'},{t:'桃園市',v:'330'},{t:'龜山鄉',v:'333'},{t:'八德市',v:'334'},{t:'大溪鎮',v:'335'},{t:'復興鄉',v:'336'},{t:'大園鄉',v:'337'},{t:'蘆竹鄉',v:'338'}]},
{t:'新竹市',v:'5',c:'O',zip:[{t:'東區',v:'300'},{t:'北區',v:'300'},{t:'香山區',v:'300'}]},
{t:'新竹縣',v:'6',c:'J',zip:[{t:'竹北市',v:'302'},{t:'湖口鄉',v:'303'},{t:'新豐鄉',v:'304'},{t:'新埔鎮',v:'305'},{t:'關西鎮',v:'306'},{t:'芎林鄉',v:'307'},{t:'寶山鄉',v:'308'},{t:'竹東鎮',v:'310'},{t:'五峰鄉',v:'311'},{t:'橫山鄉',v:'312'},{t:'北埔鄉',v:'313'},{t:'峨眉鄉',v:'315'}]},
{t:'苗栗縣',v:'7',c:'K',zip:[{t:'竹南鎮',v:'350'},{t:'頭份鎮',v:'351'},{t:'三灣鄉',v:'352'},{t:'南庄鄉',v:'353'},{t:'獅潭鄉',v:'354'},{t:'後龍鎮',v:'356'},{t:'通霄鎮',v:'357'},{t:'苑裡鎮',v:'358'},{t:'苗栗市',v:'360'},{t:'造橋鄉',v:'361'},{t:'頭屋鄉',v:'362'},{t:'公館鄉',v:'363'},{t:'大湖鄉',v:'364'},{t:'泰安鄉',v:'365'},{t:'銅鑼鄉',v:'366'},{t:'三義鄉',v:'367'},{t:'西湖鄉',v:'368'},{t:'卓蘭鎮',v:'369'}]},
{t:'臺中市',v:'8',c:'B',zip:[{t:'中區',v:'400'},{t:'東區',v:'401'},{t:'南區',v:'402'},{t:'西區',v:'403'},{t:'北區',v:'404'},{t:'北屯區',v:'406'},{t:'西屯區',v:'407'},{t:'南屯區',v:'408'}]},
{t:'臺中縣',v:'9',c:'L',zip:[{t:'太平市',v:'411'},{t:'大里市',v:'412'},{t:'霧峰鄉',v:'413'},{t:'烏日鄉',v:'414'},{t:'豐原市',v:'420'},{t:'后里鄉',v:'421'},{t:'石岡鄉',v:'422'},{t:'東勢鎮',v:'423'},{t:'和平鄉',v:'424'},{t:'新社鄉',v:'426'},{t:'潭子鄉',v:'427'},{t:'大雅鄉',v:'428'},{t:'神岡鄉',v:'429'},{t:'大肚鄉',v:'432'},{t:'沙鹿鎮',v:'433'},{t:'龍井鄉',v:'434'},{t:'梧棲鎮',v:'435'},{t:'清水鎮',v:'436'},{t:'大甲鎮',v:'437'},{t:'外埔鄉',v:'438'},{t:'大安鄉',v:'439'}]},
{t:'彰化縣',v:'10',c:'N',zip:[{t:'彰化市',v:'500'},{t:'芬園鄉',v:'502'},{t:'花壇鄉',v:'503'},{t:'秀水鄉',v:'504'},{t:'鹿港鎮',v:'505'},{t:'福興鄉',v:'506'},{t:'線西鄉',v:'507'},{t:'和美鎮',v:'508'},{t:'伸港鄉',v:'509'},{t:'員林鎮',v:'510'},{t:'社頭鄉',v:'511'},{t:'永靖鄉',v:'512'},{t:'埔心鄉',v:'513'},{t:'溪湖鎮',v:'514'},{t:'大村鄉',v:'515'},{t:'埔鹽鄉',v:'516'},{t:'田中鎮',v:'520'},{t:'北斗鎮',v:'521'},{t:'田尾鄉',v:'522'},{t:'埤頭鄉',v:'523'},{t:'溪州鄉',v:'524'},{t:'竹塘鄉',v:'525'},{t:'二林鎮',v:'526'},{t:'大城鄉',v:'527'},{t:'芳苑鄉',v:'528'},{t:'二水鄉',v:'530'}]},
{t:'南投縣',v:'11',c:'M',zip:[{t:'南投市',v:'540'},{t:'中寮鄉',v:'541'},{t:'草屯鎮',v:'542'},{t:'國姓鄉',v:'544'},{t:'埔里鎮',v:'545'},{t:'仁愛鄉',v:'546'},{t:'名間鄉',v:'551'},{t:'集集鎮',v:'552'},{t:'水里鄉',v:'553'},{t:'魚池鄉',v:'555'},{t:'信義鄉',v:'556'},{t:'竹山鎮',v:'557'},{t:'鹿谷鄉',v:'558'}]},
{t:'嘉義市',v:'12',c:'I',zip:[{t:'東區',v:'600'},{t:'西區',v:'600'}]},
{t:'嘉義縣',v:'13',c:'Q',zip:[{t:'番路鄉',v:'602'},{t:'梅山鄉',v:'603'},{t:'竹崎鄉',v:'604'},{t:'阿里山',v:'605'},{t:'中埔鄉',v:'606'},{t:'大埔鄉',v:'607'},{t:'水上鄉',v:'608'},{t:'鹿草鄉',v:'611'},{t:'太保市',v:'612'},{t:'朴子市',v:'613'},{t:'東石鄉',v:'614'},{t:'六腳鄉',v:'615'},{t:'新港鄉',v:'616'},{t:'民雄鄉',v:'621'},{t:'大林鎮',v:'622'},{t:'溪口鄉',v:'623'},{t:'義竹鄉',v:'624'},{t:'布袋鎮',v:'625'}]},
{t:'雲林縣',v:'14',c:'P',zip:[{t:'斗南鎮',v:'630'},{t:'大埤鄉',v:'631'},{t:'虎尾鎮',v:'632'},{t:'土庫鎮',v:'633'},{t:'褒忠鄉',v:'634'},{t:'東勢鄉',v:'635'},{t:'台西鄉',v:'636'},{t:'崙背鄉',v:'637'},{t:'麥寮鄉',v:'638'},{t:'斗六市',v:'640'},{t:'林內鄉',v:'643'},{t:'古坑鄉',v:'646'},{t:'莿桐鄉',v:'647'},{t:'西螺鎮',v:'648'},{t:'二崙鄉',v:'649'},{t:'北港鎮',v:'651'},{t:'水林鄉',v:'652'},{t:'口湖鄉',v:'653'},{t:'四湖鄉',v:'654'},{t:'元長鄉',v:'655'}]},
{t:'臺南市',v:'15',c:'D',zip:[{t:'中西區',v:'700'},{t:'東區',v:'701'},{t:'南區',v:'702'},{t:'北區',v:'704'},{t:'安平區',v:'708'},{t:'安南區',v:'709'}]},
{t:'臺南縣',v:'16',c:'R',zip:[{t:'永康市',v:'710'},{t:'歸仁鄉',v:'711'},{t:'新化鎮',v:'712'},{t:'左鎮鄉',v:'713'},{t:'玉井鄉',v:'714'},{t:'楠西鄉',v:'715'},{t:'南化鄉',v:'716'},{t:'仁德鄉',v:'717'},{t:'關廟鄉',v:'718'},{t:'龍崎鄉',v:'719'},{t:'官田鄉',v:'720'},{t:'麻豆鎮',v:'721'},{t:'佳里鎮',v:'722'},{t:'西港鄉',v:'723'},{t:'七股鄉',v:'724'},{t:'將軍鄉',v:'725'},{t:'學甲鎮',v:'726'},{t:'北門鄉',v:'727'},{t:'新營市',v:'730'},{t:'後壁鄉',v:'731'},{t:'白河鎮',v:'732'},{t:'東山鄉',v:'733'},{t:'六甲鄉',v:'734'},{t:'下營鄉',v:'735'},{t:'柳營鄉',v:'736'},{t:'鹽水鎮',v:'737'},{t:'善化鎮',v:'741'},{t:'大內鄉',v:'742'},{t:'山上鄉',v:'743'},{t:'新市鄉',v:'744'},{t:'安定鄉',v:'745'}]},
{t:'高雄市',v:'17',c:'E',zip:[{t:'新興區',v:'800'},{t:'前金區',v:'801'},{t:'苓雅區',v:'802'},{t:'鹽埕區',v:'803'},{t:'鼓山區',v:'804'},{t:'旗津區',v:'805'},{t:'前鎮區',v:'806'},{t:'三民區',v:'807'},{t:'楠梓區',v:'811'},{t:'小港區',v:'812'},{t:'左營區',v:'813'}]},
{t:'高雄縣',v:'18',c:'S',zip:[{t:'仁武鄉',v:'814'},{t:'大社鄉',v:'815'},{t:'岡山鎮',v:'820'},{t:'路竹鄉',v:'821'},{t:'阿蓮鄉',v:'822'},{t:'田寮鄉',v:'823'},{t:'燕巢鄉',v:'824'},{t:'橋頭鄉',v:'825'},{t:'梓官鄉',v:'826'},{t:'彌陀鄉',v:'827'},{t:'永安鄉',v:'828'},{t:'湖內鄉',v:'829'},{t:'鳳山市',v:'830'},{t:'大寮鄉',v:'831'},{t:'林園鄉',v:'832'},{t:'鳥松鄉',v:'833'},{t:'大樹鄉',v:'840'},{t:'旗山鎮',v:'842'},{t:'美濃鎮',v:'843'},{t:'六龜鄉',v:'844'},{t:'內門鄉',v:'845'},{t:'杉林鄉',v:'846'},{t:'甲仙鄉',v:'847'},{t:'桃源鄉',v:'848'},{t:'三民鄉',v:'849'},{t:'茂林鄉',v:'851'},{t:'茄萣鄉',v:'852'}]},
{t:'屏東縣',v:'19',c:'T',zip:[{t:'屏東市',v:'900'},{t:'三地門',v:'901'},{t:'霧台鄉',v:'902'},{t:'瑪家鄉',v:'903'},{t:'九如鄉',v:'904'},{t:'里港鄉',v:'905'},{t:'高樹鄉',v:'906'},{t:'鹽埔鄉',v:'907'},{t:'長治鄉',v:'908'},{t:'麟洛鄉',v:'909'},{t:'竹田鄉',v:'911'},{t:'內埔鄉',v:'912'},{t:'萬丹鄉',v:'913'},{t:'潮州鎮',v:'920'},{t:'泰武鄉',v:'921'},{t:'來義鄉',v:'922'},{t:'萬巒鄉',v:'923'},{t:'崁頂鄉',v:'924'},{t:'新埤鄉',v:'925'},{t:'南州鄉',v:'926'},{t:'林邊鄉',v:'927'},{t:'東港鎮',v:'928'},{t:'琉球鄉',v:'929'},{t:'佳冬鄉',v:'931'},{t:'新園鄉',v:'932'},{t:'枋寮鄉',v:'940'},{t:'枋山鄉',v:'941'},{t:'春日鄉',v:'942'},{t:'獅子鄉',v:'943'},{t:'車城鄉',v:'944'},{t:'牡丹鄉',v:'945'},{t:'恆春鎮',v:'946'},{t:'滿州鄉',v:'947'}]},
{t:'花蓮縣',v:'20',c:'U',zip:[{t:'花蓮市',v:'970'},{t:'新城鄉',v:'971'},{t:'秀林鄉',v:'972'},{t:'吉安鄉',v:'973'},{t:'壽豐鄉',v:'974'},{t:'鳳林鎮',v:'975'},{t:'光復鄉',v:'976'},{t:'豐濱鄉',v:'977'},{t:'瑞穗鄉',v:'978'},{t:'萬榮鄉',v:'979'},{t:'玉里鎮',v:'981'},{t:'卓溪鄉',v:'982'},{t:'富里鄉',v:'983'}]},
{t:'臺東縣',v:'21',c:'V',zip:[{t:'臺東市',v:'950'},{t:'綠島鄉',v:'951'},{t:'蘭嶼鄉',v:'952'},{t:'延平鄉',v:'953'},{t:'卑南鄉',v:'954'},{t:'鹿野鄉',v:'955'},{t:'關山鎮',v:'956'},{t:'海端鄉',v:'957'},{t:'池上鄉',v:'958'},{t:'東河鄉',v:'959'},{t:'成功鎮',v:'961'},{t:'長濱鄉',v:'962'},{t:'太麻里',v:'963'},{t:'金峰鄉',v:'964'},{t:'大武鄉',v:'965'},{t:'達仁鄉',v:'966'}]},
{t:'金門縣',v:'22',c:'W',zip:[{t:'金沙鎮',v:'890'},{t:'金湖鎮',v:'891'},{t:'金寧鎮',v:'892'},{t:'金城鎮',v:'893'},{t:'烈嶼鄉',v:'894'},{t:'烏坵鄉',v:'896'}]},
{t:'澎湖縣',v:'23',c:'X',zip:[{t:'馬公市',v:'880'},{t:'西嶼鄉',v:'881'},{t:'望安鄉',v:'882'},{t:'七美鄉',v:'883'},{t:'白沙鄉',v:'884'},{t:'湖西鄉',v:'885'}]},
{t:'連江縣',v:'24',c:'Z',zip:[{t:'南竿鄉',v:'209'},{t:'北竿鄉',v:'210'},{t:'莒光鄉',v:'211'},{t:'東引鄉',v:'212'}]}];

String.prototype.trim = function() { return this.replace(/(^\s*)|(\s*$)/g, ""); } //去除頭尾空白

	$.twzip = function(zip, form) {
		var data = zipcode;
		var county = createMenuList();
		county.setAttribute("id", "city");
		var area = createMenuList();
		area.setAttribute("id", "area");
		var road = createMenuList();
		road.setAttribute("id", "road");
		road.setAttribute("disabled", true);
		
		zip.parentNode.insertBefore(county, zip);
		zip.parentNode.insertBefore(area, zip);
		zip.parentNode.insertBefore(road, zip);

		$(data).each(function() {
			addMenuItem(county, this.t, this.v, function() {
				var code = data[this.value].c;
				removeAllItems(area);
				removeAllItems(road);
				road.setAttribute("disabled", true);
				$(data[this.value].zip).each(function() {
					addMenuItem(area, this.t, this.v, function() {
						removeAllItems(road);
						var arealab = this.label;
						var areaval = this.value;
						var dataPath = 'data/';
						$.getJSON(dataPath + code + '.js', function(json) {
							twzipcode_result = [];										
							search(areaval, json[0][arealab]);
							for (var da in twzipcode_result) {
								if (da) {
									addMenuItem(road, twzipcode_result[da][0] + ' (' + twzipcode_result[da][2].trim() + ')', twzipcode_result[da][1], function() {	
										zip.value = this.value;
									});
								}
							}
							road.setAttribute("disabled", false);
							road.selectedIndex = 0;
						});
					});
					area.selectedIndex = 0;
					road.selectedIndex = 0;
				});
			});
		});
		
		function createMenuList() {
			var menulist = document.createElementNS(XUL_NS, "menulist");
			var menupopup = createMenuPopup();
			menulist.appendChild(menupopup);
			return menulist;
		}
		
		function createMenuPopup() {
			var menupopup = document.createElementNS(XUL_NS, "menupopup");
			var menuitem = document.createElementNS(XUL_NS, "menuitem");
			menuitem.setAttribute("label", "-- 請選擇 --");
			menuitem.addEventListener("command", function() {
				removeAllItems(area);
				removeAllItems(road);
				road.setAttribute("disabled", true);
			}, true);
			menupopup.appendChild(menuitem);
			return menupopup;
		}
		
		function addMenuItem(_menulist, _label, _value, _command) {
			var menuitem = document.createElementNS(XUL_NS, "menuitem");
			menuitem.setAttribute("label", _label);
			menuitem.setAttribute("value", _value);
			if(_command) menuitem.addEventListener("command", _command, true);
			_menulist.firstChild.appendChild(menuitem);
		}
		
		function removeAllItems(_menulist) {
			var menupopup = createMenuPopup();
			_menulist.removeAllItems();
			_menulist.appendChild(menupopup);
			zip.value = "";
			return _menulist;
		}
		
        /*
         * seach the math data and append to array
         */
        var search = function(z, obj) {
            var rg;
            var zip = [];
            for (var i in obj) {
                if ('undefined' !== i) {
                    if ('object' === typeof(obj[i])) {
                        search(z, obj[i]);
                    }
                    if ('zipcode' === i) {
                        rg = new RegExp('^' + z + '+');
                        if (-1 !== obj[i].toString().search(rg)) {
                            zip = [obj.road, obj.zipcode, obj.scope];
                            twzipcode_result.push(zip);
                        }
                    }
                }
            }
        };
	};
})(jQuery);